---
kind: type
id: T:Autodesk.Revit.DB.Plumbing.PipeInsulationType
source: html/1e9c8ce4-8447-ad6e-d92e-c68ad1a384b5.htm
---
# Autodesk.Revit.DB.Plumbing.PipeInsulationType

This class represents a pipe insulation type in Autodesk Revit.

## Syntax (C#)
```csharp
public class PipeInsulationType : ElementType
```